app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-08-16 17:54:58.477585"], ["id", 1]]
---
  def update
    @article.update(title: params[:article][:title], description: params[:article][:description])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_article
    @article = Article.find(params[:id])